==================
Equality
==================

distance == 20

---

(expression
  (binary_expression
    (identifier)
    (number)))

==================
Arithmetic
==================

4.5 * 10 == 40 + 5

---

(expression
  (binary_expression
    (binary_expression
      (number)
      (number))
    (binary_expression
      (number)
      (number))))

==================
Prefixes
==================

-4.5 * +10 == -45

---

(expression
  (binary_expression
    (binary_expression
      (prefix_expression
        (number))
      (prefix_expression
        (number)))
    (prefix_expression
      (number))))

==================
Field access
==================

geometry.area

---

(expression
  (field_access
    (identifier)
    (identifier)))

==================
Gradient comparison
==================

gradient(25, 'traffic', 0, 50) == yellow

---

(expression
  (binary_expression
    (method_invocation
      (identifier)
      (argument_list
        (number)
        (string)
        (number)
        (number)
      )
    )
    (identifier)
  )
)

==================
Gradient comparison 2
==================

gradient(25, 'alpha', 0, 50, red) == RGB(255, 0, 0, 0.5)

---

(expression
  (binary_expression
    (method_invocation
      (identifier)
      (argument_list
        (number)
        (string)
        (number)
        (number)
        (identifier)))
    (method_invocation
      (type_identifier)
      (argument_list
        (number)
        (number)
        (number)
        (number)))))

==================
Function call on identifier
==================

geometry.fill(red)

---

(expression
  (method_invocation
    (identifier)
    (identifier)
    (argument_list
      (identifier))))
    

==================
Function call on function
==================

line(Position(33, -151)).fill(green)

---

(expression
  (method_invocation
    (method_invocation
      (identifier)
      (argument_list
        (method_invocation
          (type_identifier)
          (argument_list
            (number)
            (prefix_expression
              (number))))))
    (identifier)
    (argument_list
      (identifier))))

================================================================================
Conjunction with call sites
================================================================================

a
    && c.b()

--------------------------------------------------------------------------------

(expression
  (binary_expression
    (identifier)
    (method_invocation
      (identifier)
      (identifier)
      (argument_list))))

================================================================================
Ternary expression
================================================================================

someVeryLongFunctionCall()
    ? doSomethingHere()
    : fallback

--------------------------------------------------------------------------------

(expression
  (ternary_expression
    (method_invocation
      (identifier)
      (argument_list))
    (method_invocation
      (identifier)
      (argument_list))
    (identifier)))

================================================================================
Switch with open ranges
================================================================================

switch(dist)
  .case(..<2000, "ðŸš¶â€â™‚ï¸")
  .case(..<10000, "ðŸš´â€â™€ï¸")
  .default("ðŸšŒ")

--------------------------------------------------------------------------------

(expression
  (method_invocation
    (method_invocation
      (method_invocation
        (method_invocation
          (identifier)
          (argument_list
            (identifier)))
        (identifier)
        (argument_list
          (open_start_range_expression
            (number))
          (string)))
      (identifier)
      (argument_list
        (open_start_range_expression
          (number))
        (string)))
    (identifier)
    (argument_list
      (string))))

================================================================================
Switch with closed range
================================================================================

switch(name)
  .case("Covid-19 in NSW",
    switch(covidLastWeek)
      .case(0, clear)
      .case(1...5, yellow)
      .default(red)
      .alpha(0.2)
  )
  .case("Sydney Friends", blue)
  .default(black)

--------------------------------------------------------------------------------

(expression
  (method_invocation
    (method_invocation
      (method_invocation
        (method_invocation
          (identifier)
          (argument_list
            (identifier)))
        (identifier)
        (argument_list
          (string)
          (method_invocation
            (method_invocation
              (method_invocation
                (method_invocation
                  (method_invocation
                    (identifier)
                    (argument_list
                      (identifier)))
                  (identifier)
                  (argument_list
                    (number)
                    (identifier)))
                (identifier)
                (argument_list
                  (range_expression
                    (number)
                    (number))
                  (identifier)))
              (identifier)
              (argument_list
                (identifier)))
            (identifier)
            (argument_list
              (number)))))
      (identifier)
      (argument_list
        (string)
        (identifier)))
    (identifier)
    (argument_list
      (identifier))))