================================================================================
Identifiers
================================================================================

geometry

--------------------------------------------------------------------------------

(expression
  (constant))

================================================================================
Identifiers with ticks
================================================================================

`my geometry`

--------------------------------------------------------------------------------

(expression
  (identifier))  

================================================================================
Boolean literals - true
================================================================================

true

--------------------------------------------------------------------------------

(expression
  (boolean))

================================================================================
Boolean literals - false
================================================================================

false

--------------------------------------------------------------------------------

(expression
  (boolean))

================================================================================
String literal - double quoted
================================================================================

"Hello World!"

--------------------------------------------------------------------------------

(expression
  (string))

================================================================================
String literal - single quoted
================================================================================

'Hello World!'

--------------------------------------------------------------------------------

(expression
  (string))

================================================================================
Integer literals - 0
================================================================================

0

--------------------------------------------------------------------------------

(expression
  (number))

================================================================================
Integer literals - 9847
================================================================================

9847

--------------------------------------------------------------------------------

(expression
  (number))

================================================================================
Real literals - 0.0
================================================================================

0.0

--------------------------------------------------------------------------------

(expression
  (number))

================================================================================
Real literals - Negative
================================================================================

-23.434

--------------------------------------------------------------------------------

(expression
  (prefix_expression
    (number)))


================================================================================
Stars
================================================================================

★★★☆☆

--------------------------------------------------------------------------------

(expression
  (rating))


================================================================================
Array
================================================================================

[
  geometry.transform('BoundingBox').fill(yellow.alpha(0.2)),
  Style(geometry).fill(red.alpha(0.5))
]

--------------------------------------------------------------------------------

(expression
  (array
    (method_invocation
      (method_invocation
        (constant)
        (identifier)
        (argument_list
          (string)))
      (identifier)
      (argument_list
        (method_invocation
          (constant)
          (identifier)
          (argument_list
            (number)))))
    (method_invocation
      (method_invocation
        (type_identifier)
        (argument_list
          (constant)))
      (identifier)
      (argument_list
        (method_invocation
          (constant)
          (identifier)
          (argument_list
            (number)))))))

================================================================================
Array with trailing comma
================================================================================

[
  4, 
  2,
]

--------------------------------------------------------------------------------

(expression
  (array
    (number)
    (number)))
